GopalSaraf/Practicals/PSDL/include/proc/pic16f18854.h
// Register: IOCAF
#define IOCAF IOCAF
extern volatile unsigned char           IOCAF               __at(0xF3F);
#ifndef _LIB_BUILD
asm("IOCAF equ 0F3Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCAF0                 :1;
        unsigned IOCAF1                 :1;
        unsigned IOCAF2                 :1;
        unsigned IOCAF3                 :1;
        unsigned IOCAF4                 :1;
        unsigned IOCAF5                 :1;
        unsigned IOCAF6                 :1;
        unsigned IOCAF7                 :1;
    };
} IOCAFbits_t;
extern volatile IOCAFbits_t IOCAFbits __at(0xF3F);
// bitfield macros
#define _IOCAF_IOCAF0_POSN                                  0x0
#define _IOCAF_IOCAF0_POSITION                              0x0
#define _IOCAF_IOCAF0_SIZE                                  0x1
#define _IOCAF_IOCAF0_LENGTH                                0x1
#define _IOCAF_IOCAF0_MASK                                  0x1
#define _IOCAF_IOCAF1_POSN                                  0x1
#define _IOCAF_IOCAF1_POSITION                              0x1
#define _IOCAF_IOCAF1_SIZE                                  0x1
#define _IOCAF_IOCAF1_LENGTH                                0x1
#define _IOCAF_IOCAF1_MASK                                  0x2
#define _IOCAF_IOCAF2_POSN                                  0x2
#define _IOCAF_IOCAF2_POSITION                              0x2
#define _IOCAF_IOCAF2_SIZE                                  0x1
#define _IOCAF_IOCAF2_LENGTH                                0x1
#define _IOCAF_IOCAF2_MASK                                  0x4
#define _IOCAF_IOCAF3_POSN                                  0x3
#define _IOCAF_IOCAF3_POSITION                              0x3
#define _IOCAF_IOCAF3_SIZE                                  0x1
#define _IOCAF_IOCAF3_LENGTH                                0x1
#define _IOCAF_IOCAF3_MASK                                  0x8
#define _IOCAF_IOCAF4_POSN                                  0x4
#define _IOCAF_IOCAF4_POSITION                              0x4
#define _IOCAF_IOCAF4_SIZE                                  0x1
#define _IOCAF_IOCAF4_LENGTH                                0x1
#define _IOCAF_IOCAF4_MASK                                  0x10
#define _IOCAF_IOCAF5_POSN                                  0x5
#define _IOCAF_IOCAF5_POSITION                              0x5
#define _IOCAF_IOCAF5_SIZE                                  0x1
#define _IOCAF_IOCAF5_LENGTH                                0x1
#define _IOCAF_IOCAF5_MASK                                  0x20
#define _IOCAF_IOCAF6_POSN                                  0x6
#define _IOCAF_IOCAF6_POSITION                              0x6
#define _IOCAF_IOCAF6_SIZE                                  0x1
#define _IOCAF_IOCAF6_LENGTH                                0x1
#define _IOCAF_IOCAF6_MASK                                  0x40
#define _IOCAF_IOCAF7_POSN                                  0x7
#define _IOCAF_IOCAF7_POSITION                              0x7
#define _IOCAF_IOCAF7_SIZE                                  0x1
#define _IOCAF_IOCAF7_LENGTH                                0x1
#define _IOCAF_IOCAF7_MASK                                  0x80

// Register: CCDNA
#define CCDNA CCDNA
extern volatile unsigned char           CCDNA               __at(0xF40);
#ifndef _LIB_BUILD
asm("CCDNA equ 0F40h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDNA0                 :1;
        unsigned CCDNA1                 :1;
        unsigned CCDNA2                 :1;
        unsigned CCDNA3                 :1;
        unsigned CCDNA4                 :1;
        unsigned CCDNA5                 :1;
        unsigned CCDNA6                 :1;
        unsigned CCDNA7                 :1;
    };
} CCDNAbits_t;
extern volatile CCDNAbits_t CCDNAbits __at(0xF40);
// bitfield macros
#define _CCDNA_CCDNA0_POSN                                  0x0
#define _CCDNA_CCDNA0_POSITION                              0x0
#define _CCDNA_CCDNA0_SIZE                                  0x1
#define _CCDNA_CCDNA0_LENGTH                                0x1
#define _CCDNA_CCDNA0_MASK                                  0x1
#define _CCDNA_CCDNA1_POSN                                  0x1
#define _CCDNA_CCDNA1_POSITION                              0x1
#define _CCDNA_CCDNA1_SIZE                                  0x1
#define _CCDNA_CCDNA1_LENGTH                                0x1
#define _CCDNA_CCDNA1_MASK                                  0x2
#define _CCDNA_CCDNA2_POSN                                  0x2
#define _CCDNA_CCDNA2_POSITION                              0x2
#define _CCDNA_CCDNA2_SIZE                                  0x1
#define _CCDNA_CCDNA2_LENGTH                                0x1
#define _CCDNA_CCDNA2_MASK                                  0x4
#define _CCDNA_CCDNA3_POSN                                  0x3
#define _CCDNA_CCDNA3_POSITION                              0x3
#define _CCDNA_CCDNA3_SIZE                                  0x1
#define _CCDNA_CCDNA3_LENGTH                                0x1
#define _CCDNA_CCDNA3_MASK                                  0x8
#define _CCDNA_CCDNA4_POSN                                  0x4
#define _CCDNA_CCDNA4_POSITION                              0x4
#define _CCDNA_CCDNA4_SIZE                                  0x1
#define _CCDNA_CCDNA4_LENGTH                                0x1
#define _CCDNA_CCDNA4_MASK                                  0x10
#define _CCDNA_CCDNA5_POSN                                  0x5
#define _CCDNA_CCDNA5_POSITION                              0x5
#define _CCDNA_CCDNA5_SIZE                                  0x1
#define _CCDNA_CCDNA5_LENGTH                                0x1
#define _CCDNA_CCDNA5_MASK                                  0x20
#define _CCDNA_CCDNA6_POSN                                  0x6
#define _CCDNA_CCDNA6_POSITION                              0x6
#define _CCDNA_CCDNA6_SIZE                                  0x1
#define _CCDNA_CCDNA6_LENGTH                                0x1
#define _CCDNA_CCDNA6_MASK                                  0x40
#define _CCDNA_CCDNA7_POSN                                  0x7
#define _CCDNA_CCDNA7_POSITION                              0x7
#define _CCDNA_CCDNA7_SIZE                                  0x1
#define _CCDNA_CCDNA7_LENGTH                                0x1
#define _CCDNA_CCDNA7_MASK                                  0x80

// Register: CCDPA
#define CCDPA CCDPA
extern volatile unsigned char           CCDPA               __at(0xF41);
#ifndef _LIB_BUILD
asm("CCDPA equ 0F41h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDPA0                 :1;
        unsigned CCDPA1                 :1;
        unsigned CCDPA2                 :1;
        unsigned CCDPA3                 :1;
        unsigned CCDPA4                 :1;
        unsigned CCDPA5                 :1;
        unsigned CCDPA6                 :1;
        unsigned CCDPA7                 :1;
    };
} CCDPAbits_t;
extern volatile CCDPAbits_t CCDPAbits __at(0xF41);
// bitfield macros
#define _CCDPA_CCDPA0_POSN                                  0x0
#define _CCDPA_CCDPA0_POSITION                              0x0
#define _CCDPA_CCDPA0_SIZE                                  0x1
#define _CCDPA_CCDPA0_LENGTH                                0x1
#define _CCDPA_CCDPA0_MASK                                  0x1
#define _CCDPA_CCDPA1_POSN                                  0x1
#define _CCDPA_CCDPA1_POSITION                              0x1
#define _CCDPA_CCDPA1_SIZE                                  0x1
#define _CCDPA_CCDPA1_LENGTH                                0x1
#define _CCDPA_CCDPA1_MASK                                  0x2
#define _CCDPA_CCDPA2_POSN                                  0x2
#define _CCDPA_CCDPA2_POSITION                              0x2
#define _CCDPA_CCDPA2_SIZE                                  0x1
#define _CCDPA_CCDPA2_LENGTH                                0x1
#define _CCDPA_CCDPA2_MASK                                  0x4
#define _CCDPA_CCDPA3_POSN                                  0x3
#define _CCDPA_CCDPA3_POSITION                              0x3
#define _CCDPA_CCDPA3_SIZE                                  0x1
#define _CCDPA_CCDPA3_LENGTH                                0x1
#define _CCDPA_CCDPA3_MASK                                  0x8
#define _CCDPA_CCDPA4_POSN                                  0x4
#define _CCDPA_CCDPA4_POSITION                              0x4
#define _CCDPA_CCDPA4_SIZE                                  0x1
#define _CCDPA_CCDPA4_LENGTH                                0x1
#define _CCDPA_CCDPA4_MASK                                  0x10
#define _CCDPA_CCDPA5_POSN                                  0x5
#define _CCDPA_CCDPA5_POSITION                              0x5
#define _CCDPA_CCDPA5_SIZE                                  0x1
#define _CCDPA_CCDPA5_LENGTH                                0x1
#define _CCDPA_CCDPA5_MASK                                  0x20
#define _CCDPA_CCDPA6_POSN                                  0x6
#define _CCDPA_CCDPA6_POSITION                              0x6
#define _CCDPA_CCDPA6_SIZE                                  0x1
#define _CCDPA_CCDPA6_LENGTH                                0x1
#define _CCDPA_CCDPA6_MASK                                  0x40
#define _CCDPA_CCDPA7_POSN                                  0x7
#define _CCDPA_CCDPA7_POSITION                              0x7
#define _CCDPA_CCDPA7_SIZE                                  0x1
#define _CCDPA_CCDPA7_LENGTH                                0x1
#define _CCDPA_CCDPA7_MASK                                  0x80

// Register: ANSELB
#define ANSELB ANSELB
extern volatile unsigned char           ANSELB              __at(0xF43);
#ifndef _LIB_BUILD
asm("ANSELB equ 0F43h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSB0                  :1;
        unsigned ANSB1                  :1;
        unsigned ANSB2                  :1;
        unsigned ANSB3                  :1;
        unsigned ANSB4                  :1;
        unsigned ANSB5                  :1;
        unsigned ANSB6                  :1;
        unsigned ANSB7                  :1;
    };
} ANSELBbits_t;
extern volatile ANSELBbits_t ANSELBbits __at(0xF43);
// bitfield macros
#define _ANSELB_ANSB0_POSN                                  0x0
#define _ANSELB_ANSB0_POSITION                              0x0
#define _ANSELB_ANSB0_SIZE                                  0x1
#define _ANSELB_ANSB0_LENGTH                                0x1
#define _ANSELB_ANSB0_MASK                                  0x1
#define _ANSELB_ANSB1_POSN                                  0x1
#define _ANSELB_ANSB1_POSITION                              0x1
#define _ANSELB_ANSB1_SIZE                                  0x1
#define _ANSELB_ANSB1_LENGTH                                0x1
#define _ANSELB_ANSB1_MASK                                  0x2
#define _ANSELB_ANSB2_POSN                                  0x2
#define _ANSELB_ANSB2_POSITION                              0x2
#define _ANSELB_ANSB2_SIZE                                  0x1
#define _ANSELB_ANSB2_LENGTH                                0x1
#define _ANSELB_ANSB2_MASK                                  0x4
#define _ANSELB_ANSB3_POSN                                  0x3
#define _ANSELB_ANSB3_POSITION                              0x3
#define _ANSELB_ANSB3_SIZE                                  0x1
#define _ANSELB_ANSB3_LENGTH                                0x1
#define _ANSELB_ANSB3_MASK                                  0x8
#define _ANSELB_ANSB4_POSN                                  0x4
#define _ANSELB_ANSB4_POSITION                              0x4
#define _ANSELB_ANSB4_SIZE                                  0x1
#define _ANSELB_ANSB4_LENGTH                                0x1
#define _ANSELB_ANSB4_MASK                                  0x10
#define _ANSELB_ANSB5_POSN                                  0x5
#define _ANSELB_ANSB5_POSITION                              0x5
#define _ANSELB_ANSB5_SIZE                                  0x1
#define _ANSELB_ANSB5_LENGTH                                0x1
#define _ANSELB_ANSB5_MASK                                  0x20
#define _ANSELB_ANSB6_POSN                                  0x6
#define _ANSELB_ANSB6_POSITION                              0x6
#define _ANSELB_ANSB6_SIZE                                  0x1
#define _ANSELB_ANSB6_LENGTH                                0x1
#define _ANSELB_ANSB6_MASK                                  0x40
#define _ANSELB_ANSB7_POSN                                  0x7
#define _ANSELB_ANSB7_POSITION                              0x7
#define _ANSELB_ANSB7_SIZE                                  0x1
#define _ANSELB_ANSB7_LENGTH                                0x1
#define _ANSELB_ANSB7_MASK                                  0x80

// Register: WPUB
#define WPUB WPUB
extern volatile unsigned char           WPUB                __at(0xF44);
#ifndef _LIB_BUILD
asm("WPUB equ 0F44h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUB0                  :1;
        unsigned WPUB1                  :1;
        unsigned WPUB2                  :1;
        unsigned WPUB3                  :1;
        unsigned WPUB4                  :1;
        unsigned WPUB5                  :1;
        unsigned WPUB6                  :1;
        unsigned WPUB7                  :1;
    };
} WPUBbits_t;
extern volatile WPUBbits_t WPUBbits __at(0xF44);
// bitfield macros
#define _WPUB_WPUB0_POSN                                    0x0
#define _WPUB_WPUB0_POSITION                                0x0
#define _WPUB_WPUB0_SIZE                                    0x1
#define _WPUB_WPUB0_LENGTH                                  0x1
#define _WPUB_WPUB0_MASK                                    0x1
#define _WPUB_WPUB1_POSN                                    0x1
#define _WPUB_WPUB1_POSITION                                0x1
#define _WPUB_WPUB1_SIZE                                    0x1
#define _WPUB_WPUB1_LENGTH                                  0x1
#define _WPUB_WPUB1_MASK                                    0x2
#define _WPUB_WPUB2_POSN                                    0x2
#define _WPUB_WPUB2_POSITION                                0x2
#define _WPUB_WPUB2_SIZE                                    0x1
#define _WPUB_WPUB2_LENGTH                                  0x1
#define _WPUB_WPUB2_MASK                                    0x4
#define _WPUB_WPUB3_POSN                                    0x3
#define _WPUB_WPUB3_POSITION                                0x3
#define _WPUB_WPUB3_SIZE                                    0x1
#define _WPUB_WPUB3_LENGTH                                  0x1
#define _WPUB_WPUB3_MASK                                    0x8
#define _WPUB_WPUB4_POSN                                    0x4
#define _WPUB_WPUB4_POSITION                                0x4
#define _WPUB_WPUB4_SIZE                                    0x1
#define _WPUB_WPUB4_LENGTH                                  0x1
#define _WPUB_WPUB4_MASK                                    0x10
#define _WPUB_WPUB5_POSN                                    0x5
#define _WPUB_WPUB5_POSITION                                0x5
#define _WPUB_WPUB5_SIZE                                    0x1
#define _WPUB_WPUB5_LENGTH                                  0x1
#define _WPUB_WPUB5_MASK                                    0x20
#define _WPUB_WPUB6_POSN                                    0x6
#define _WPUB_WPUB6_POSITION                                0x6
#define _WPUB_WPUB6_SIZE                                    0x1
#define _WPUB_WPUB6_LENGTH                                  0x1
#define _WPUB_WPUB6_MASK                                    0x40
#define _WPUB_WPUB7_POSN                                    0x7
#define _WPUB_WPUB7_POSITION                                0x7
#define _WPUB_WPUB7_SIZE                                    0x1
#define _WPUB_WPUB7_LENGTH                                  0x1
#define _WPUB_WPUB7_MASK                                    0x80

// Register: ODCONB
#define ODCONB ODCONB
extern volatile unsigned char           ODCONB              __at(0xF45);
#ifndef _LIB_BUILD
asm("ODCONB equ 0F45h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCB0                  :1;
        unsigned ODCB1                  :1;
        unsigned ODCB2                  :1;
        unsigned ODCB3                  :1;
        unsigned ODCB4                  :1;
        unsigned ODCB5                  :1;
        unsigned ODCB6                  :1;
        unsigned ODCB7                  :1;
    };
} ODCONBbits_t;
extern volatile ODCONBbits_t ODCONBbits __at(0xF45);
// bitfield macros
#define _ODCONB_ODCB0_POSN                                  0x0
#define _ODCONB_ODCB0_POSITION                              0x0
#define _ODCONB_ODCB0_SIZE                                  0x1
#define _ODCONB_ODCB0_LENGTH                                0x1
#define _ODCONB_ODCB0_MASK                                  0x1
#define _ODCONB_ODCB1_POSN                                  0x1
#define _ODCONB_ODCB1_POSITION                              0x1
#define _ODCONB_ODCB1_SIZE                                  0x1
#define _ODCONB_ODCB1_LENGTH                                0x1
#define _ODCONB_ODCB1_MASK                                  0x2
#define _ODCONB_ODCB2_POSN                                  0x2
#define _ODCONB_ODCB2_POSITION                              0x2
#define _ODCONB_ODCB2_SIZE                                  0x1
#define _ODCONB_ODCB2_LENGTH                                0x1
#define _ODCONB_ODCB2_MASK                                  0x4
#define _ODCONB_ODCB3_POSN                                  0x3
#define _ODCONB_ODCB3_POSITION                              0x3
#define _ODCONB_ODCB3_SIZE                                  0x1
#define _ODCONB_ODCB3_LENGTH                                0x1
#define _ODCONB_ODCB3_MASK                                  0x8
#define _ODCONB_ODCB4_POSN                                  0x4
#define _ODCONB_ODCB4_POSITION                              0x4
#define _ODCONB_ODCB4_SIZE                                  0x1
#define _ODCONB_ODCB4_LENGTH                                0x1
#define _ODCONB_ODCB4_MASK                                  0x10
#define _ODCONB_ODCB5_POSN                                  0x5
#define _ODCONB_ODCB5_POSITION                              0x5
#define _ODCONB_ODCB5_SIZE                                  0x1
#define _ODCONB_ODCB5_LENGTH                                0x1
#define _ODCONB_ODCB5_MASK                                  0x20
#define _ODCONB_ODCB6_POSN                                  0x6
#define _ODCONB_ODCB6_POSITION                              0x6
#define _ODCONB_ODCB6_SIZE                                  0x1
#define _ODCONB_ODCB6_LENGTH                                0x1
#define _ODCONB_ODCB6_MASK                                  0x40
#define _ODCONB_ODCB7_POSN                                  0x7
#define _ODCONB_ODCB7_POSITION                              0x7
#define _ODCONB_ODCB7_SIZE                                  0x1
#define _ODCONB_ODCB7_LENGTH                                0x1
#define _ODCONB_ODCB7_MASK                                  0x80

// Register: SLRCONB
#define SLRCONB SLRCONB
extern volatile unsigned char           SLRCONB             __at(0xF46);
#ifndef _LIB_BUILD
asm("SLRCONB equ 0F46h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRB0                  :1;
        unsigned SLRB1                  :1;
        unsigned SLRB2                  :1;
        unsigned SLRB3                  :1;
        unsigned SLRB4                  :1;
        unsigned SLRB5                  :1;
        unsigned SLRB6                  :1;
        unsigned SLRB7                  :1;
    };
} SLRCONBbits_t;
extern volatile SLRCONBbits_t SLRCONBbits __at(0xF46);
// bitfield macros
#define _SLRCONB_SLRB0_POSN                                 0x0
#define _SLRCONB_SLRB0_POSITION                             0x0
#define _SLRCONB_SLRB0_SIZE                                 0x1
#define _SLRCONB_SLRB0_LENGTH                               0x1
#define _SLRCONB_SLRB0_MASK                                 0x1
#define _SLRCONB_SLRB1_POSN                                 0x1
#define _SLRCONB_SLRB1_POSITION                             0x1
#define _SLRCONB_SLRB1_SIZE                                 0x1
#define _SLRCONB_SLRB1_LENGTH                               0x1
#define _SLRCONB_SLRB1_MASK                                 0x2
#define _SLRCONB_SLRB2_POSN                                 0x2
#define _SLRCONB_SLRB2_POSITION                             0x2
#define _SLRCONB_SLRB2_SIZE                                 0x1
#define _SLRCONB_SLRB2_LENGTH                               0x1
#define _SLRCONB_SLRB2_MASK                                 0x4
#define _SLRCONB_SLRB3_POSN                                 0x3
#define _SLRCONB_SLRB3_POSITION                             0x3
#define _SLRCONB_SLRB3_SIZE                                 0x1
#define _SLRCONB_SLRB3_LENGTH                               0x1
#define _SLRCONB_SLRB3_MASK                                 0x8
#define _SLRCONB_SLRB4_POSN                                 0x4
#define _SLRCONB_SLRB4_POSITION                             0x4
#define _SLRCONB_SLRB4_SIZE                                 0x1
#define _SLRCONB_SLRB4_LENGTH                               0x1
#define _SLRCONB_SLRB4_MASK                                 0x10
#define _SLRCONB_SLRB5_POSN                                 0x5
#define _SLRCONB_SLRB5_POSITION                             0x5
#define _SLRCONB_SLRB5_SIZE                                 0x1
#define _SLRCONB_SLRB5_LENGTH                               0x1
#define _SLRCONB_SLRB5_MASK                                 0x20
#define _SLRCONB_SLRB6_POSN                                 0x6
#define _SLRCONB_SLRB6_POSITION                             0x6
#define _SLRCONB_SLRB6_SIZE                                 0x1
#define _SLRCONB_SLRB6_LENGTH                               0x1
#define _SLRCONB_SLRB6_MASK                                 0x40
#define _SLRCONB_SLRB7_POSN                                 0x7
#define _SLRCONB_SLRB7_POSITION                             0x7
#define _SLRCONB_SLRB7_SIZE                                 0x1
#define _SLRCONB_SLRB7_LENGTH                               0x1
#define _SLRCONB_SLRB7_MASK                                 0x80

// Register: INLVLB
#define INLVLB INLVLB
extern volatile unsigned char           INLVLB              __at(0xF47);
#ifndef _LIB_BUILD
asm("INLVLB equ 0F47h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLB0                :1;
        unsigned INLVLB1                :1;
        unsigned INLVLB2                :1;
        unsigned INLVLB3                :1;
        unsigned INLVLB4                :1;
        unsigned INLVLB5                :1;
        unsigned INLVLB6                :1;
        unsigned INLVLB7                :1;
    };
} INLVLBbits_t;
